      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ShortestProgram.

       PROCEDURE DIVISION.
       DisplayPrompt.
           DISPLAY "I did it".
           DISPLAY "HELLO COBOL"
           STOP RUN.
       END PROGRAM ShortestProgram.
